spec/cassettes/Create_payments_via_stripe_events/charge_succeeded/creates_a_payment_under_the_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15HXSxAqLMYq45GOcgBBDJRz
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.1
      Authorization:
      - Bearer sk_test_n4QZH7Y0rhBg0pxsSRPDG0ad
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.1","lang":"ruby","lang_version":"2.3.6 p384 (2017-12-14)","platform":"x86_64-darwin16","publisher":"stripe","uname":"Darwin
        Tomass-MacBook-Pro.local 16.7.0 Darwin Kernel Version 16.7.0: Thu Jan 11 22:59:40
        PST 2018; root:xnu-3789.73.8~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 16 Mar 2018 15:24:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1828'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_zWdHdWXjki8tX9
      Stripe-Version:
      - '2015-02-10'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15HXSxAqLMYq45GOcgBBDJRz",
          "object": "event",
          "api_version": "2014-12-22",
          "created": 1420451283,
          "data": {
            "object": {
              "id": "ch_15HXSxAqLMYq45GOreetEOzh",
              "object": "charge",
              "created": 1420451283,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "captured": true,
              "card": {
                "id": "card_15HXSvAqLMYq45GOph1DmnqB",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 1,
                "exp_year": 2017,
                "fingerprint": "YUjxXc5h8LOAv7gw",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5SSNx8l0y9biED"
              },
              "balance_transaction": "txn_15HXSxAqLMYq45GO0QdJrHPV",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_5SSNx8l0y9biED",
              "invoice": "in_15HXSxAqLMYq45GOMOVFNOka",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": null,
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15HXSxAqLMYq45GOreetEOzh/refunds",
                "data": []
              }
            }
          },
          "livemode": false,
          "pending_webhooks": 2,
          "request": "req_5SSNmPdH09h3c9",
          "type": "charge.succeeded"
        }
    http_version: 
  recorded_at: Fri, 16 Mar 2018 15:24:59 GMT
recorded_with: VCR 2.9.3
